app/controllers/school_classes_controller.rb

  def create

	  @class = SchoolClass.new(school_class_params)
	  @class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-05-17 18:52:17.902736"], ["updated_at", "2019-05-17 18:52:17.902736"]]

  def update
	@class = SchoolClass.find(params[:id])
	@class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-05-17 20:35:57.300074"], ["id", 1]]